# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import numpy as np
import pandas as pd
import random as rd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [9]:
first=pd.Series(rd.randint(1,4)for _ in range(100))
second=pd.Series(rd.randint(1,3)for _ in range(100))
third=pd.Series(rd.randint(10000,30000)for _ in range(100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [43]:
df=pd.concat([first,second,third],axis=1)
df

    0  1      2
0   1  2  15065
1   3  3  14480
2   4  1  20147
3   1  1  14238
4   4  2  22496
.. .. ..    ...
95  1  2  22791
96  2  3  16653
97  4  2  28545
98  3  2  28174
99  4  2  23921

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [44]:
df=df.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'})
df

    bedrs  bathrs  price_sqr_meter
0       1       2            15065
1       3       3            14480
2       4       1            20147
3       1       1            14238
4       4       2            22496
..    ...     ...              ...
95      1       2            22791
96      2       3            16653
97      4       2            28545
98      3       2            28174
99      4       2            23921

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [46]:
df = df.apply(lambda x: x.astype(str))
df['big_column']=df["bedrs"] + ", " + df["bathrs"] + ", " + df["price_sqr_meter"]
df

   bedrs bathrs price_sqr_meter   big_column
0      1      2           15065  1, 2, 15065
1      3      3           14480  3, 3, 14480
2      4      1           20147  4, 1, 20147
3      1      1           14238  1, 1, 14238
4      4      2           22496  4, 2, 22496
..   ...    ...             ...          ...
95     1      2           22791  1, 2, 22791
96     2      3           16653  2, 3, 16653
97     4      2           28545  4, 2, 28545
98     3      2           28174  3, 2, 28174
99     4      2           23921  4, 2, 23921

[100 rows x 4 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [20]:
#Yes The index start by 0

0        4
1        1
2    20147
Name: 2, dtype: int64

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [48]:

df =pd.concat([first,second,third],axis=0,ignore_index=True)
df

0          1
1          3
2          4
3          1
4          4
       ...
295    22791
296    16653
297    28545
298    28174
299    23921
Length: 300, dtype: int64